import unittest

class c_21_test(unittest.TestCase):
	def test_211(self):
		#21.1初识轮廓
		print("")

		#21.1.1什么是轮廓
		#21.1.2怎样绘制轮廓
		#21.1.3轮廓的近似方法
	def test_212(self):
		#21.2轮廓特征
		print("")

		#21.2.1矩
		#21.2.2轮廓面积
		#21.2.3轮廓周长
		#21.2.4轮廓近似
		#21.2.5凸包
		#21.2.6凸性检测
		#21.2.7边界矩形
		#21.2.8最小外接圆
		#21.2.9椭圆拟合
		#21.2.10线拟合
	def test_213(self):
		#21.3轮廓的性质
		print("")

		#21.3.1长宽比
		#21.3.2Extent
		#21.3.3Solidity
		#21.3.4EquivalentDiameter
		#21.3.5方向
		#21.3.6掩模和像素点
		#21.3.7最大值和最小值及它们的位置
		#21.3.8平均颜色及平均灰度
		#21.3.9极点
	def test_214(self):
		#21.4轮廓：更多函数
		print("")

		#21.4.1凸缺陷
		#21.4.2PointPolygonTest
		#21.4.3形状匹配
	def test_215(self):
		#21.5轮廓的层次结构
		print("")

		#21.5.1什么是层次结构
		#21.5.2OpenCV中层次结构
		#21.5.3轮廓检索模式
